cpp_basic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-11-20 Sun 22:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++ - Basic</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shaka" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">C++ - Basic</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0205188">预处理指令</a></li>
<li><a href="#orgd66f50f">函数</a></li>
<li><a href="#org61e6146">类型推断</a>
<ul>
<li><a href="#org4fc1044"><code>auto</code></a></li>
<li><a href="#org078013c"><code>decltype</code></a></li>
</ul>
</li>
<li><a href="#org5949756">指针</a>
<ul>
<li><a href="#org6b32c8e">智能指针</a></li>
</ul>
</li>
<li><a href="#orgf35d62c">名称空间</a></li>
<li><a href="#org7e72fe1">数组</a></li>
<li><a href="#org9606463">字符串</a></li>
<li><a href="#orgc9138e4"><code>switch</code></a></li>
<li><a href="#org4c085b0">基于区间的 <code>for</code> 循环</a></li>
<li><a href="#org41cea73">异常</a></li>
<li><a href="#orgebbf2d9"><code>const</code></a></li>
</ul>
</div>
</div>
<p>
本文是阅读 <i>Professional C++, third edition</i> 中文版<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>的读书笔记.
</p>

<div id="outline-container-org0205188" class="outline-2">
<h2 id="org0205188">预处理指令</h2>
<div class="outline-text-2" id="text-org0205188">
<ul class="org-ul">
<li>预处理指令以#字符开始. 如 <code>#pragma once</code> 可以防止文件被包含多次.</li>
<li>头文件最常见的用途是声明在其他地方定义的函数.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd66f50f" class="outline-2">
<h2 id="orgd66f50f">函数</h2>
<div class="outline-text-2" id="text-orgd66f50f">
<ul class="org-ul">
<li>函数声明通常称为"函数原型"或"签名", 以强调其代表函数的访问方式, 而不是具体的代码.</li>
<li>函数参数的默认值只能存在于函数声明中, 不能放在函数定义中.</li>
<li>与C不同, 在C++中没有形参的函数仅需要一个空的圆括号, 不需要使用 <code>void</code> 指出此处没有形参. 然而, 如果没有返回值, 仍需要使用 <code>void</code> 来指明这一点.</li>
<li><code>main()</code> 函数是程序的入口. <code>main()</code> 函数返回一个 <code>int</code> 值以指示程序的最终执行状态. <code>main()</code> 函数或者没有参数, 或者具有两个参数.</li>
</ul>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">argv</span>[])
</pre>
</div>
<ul class="org-ul">
<li>自C++11以来, C++通过拖尾返回类型(trailing return type)支持一种替代的函数语法. 函数的返回类型不再位于开头, 而放在行尾的箭头 <code>-&gt;</code> 后面. 这在指定模板函数的返回类型时非常有用.</li>
</ul>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a020f0;">auto</span> <span style="color: #0000ff;">func</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>) -&gt; <span style="color: #228b22;">int</span>
{
    <span style="color: #a020f0;">return</span> i + 1;
}
</pre>
</div>
<ul class="org-ul">
<li>C++14允许要求编译器自动推断出函数的返回类型. 为此, 需要指定返回类型为 <code>auto</code>, 并忽略所有拖尾返回类型.</li>
</ul>
</div>
</div>
<div id="outline-container-org61e6146" class="outline-2">
<h2 id="org61e6146">类型推断</h2>
<div class="outline-text-2" id="text-org61e6146">
<p>
类型推断允许编译器自动推断出表达式的类型. 类型推断有两个关键字: <code>auto</code> 和 <code>decltype</code>.
</p>
</div>
<div id="outline-container-org4fc1044" class="outline-3">
<h3 id="org4fc1044"><code>auto</code></h3>
<div class="outline-text-3" id="text-org4fc1044">
<ul class="org-ul">
<li>告诉编译器, 在编译时自动推断变量的类型.</li>
<li>用于替代函数语法.</li>
<li>用于函数返回类型的推断.</li>
<li>用于通用的 <code>lambda</code> 表达式.</li>
</ul>
</div>
</div>
<div id="outline-container-org078013c" class="outline-3">
<h3 id="org078013c"><code>decltype</code></h3>
<div class="outline-text-3" id="text-org078013c">
<ul class="org-ul">
<li>关键字 <code>decltype</code> 把表达式作为实参, 可以计算出该表达式的类型.</li>
<li>使用 <code>auto</code> 推断表达式的类型, 就不需要引用限定符和 <code>const</code> 限定符了. C++14引入了 <code>decltype(auto)</code> 来解决这个问题.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5949756" class="outline-2">
<h2 id="org5949756">指针</h2>
<div class="outline-text-2" id="text-org5949756">
<ul class="org-ul">
<li>堆是与当前函数或堆栈帧完全没有关系的内存区域. 如果想在函数调用结束之后仍然保存其中声明的变量, 可以将变量放到堆中.</li>
<li>在C++中, 应避免C中的 <code>malloc()</code> 和 <code>free()</code>, 而使用 <code>new</code> 和 <code>delete</code>, 或者 <code>new[]</code> 和 <code>delete[]</code>. 每次调用 <code>new/new[]</code>, 都必须相应地调用 <code>delete/delete[]</code>, 以避免内存泄漏. 必须确保释放(删除)在堆上分配的任何内存, 这个过程不会自动完成, 除非使用了智能指针.</li>
<li>在任何时候都应避免使用未初始化的变量, 尤其是未初始化的指针, 因为它们会指向内存中的每个随意位置. 使用这种指针很可能导致程序崩溃. 因此, 必须显示地同时声明和初始化指针. 如果不希望立即分配内存, 可以将其初始化为空指针(nullptr).</li>
<li>从技术角度看, 如果指针指向某个结构, 可以首先用 <code>*</code> 对指针解除引用, 然后使用 <code>.</code> 访问结构中的字段. 箭头运算符 <code>-&gt;</code> 允许同时对指针解除引用并访问字段.</li>
</ul>
</div>
<div id="outline-container-org6b32c8e" class="outline-3">
<h3 id="org6b32c8e">智能指针</h3>
<div class="outline-text-3" id="text-org6b32c8e">
<p>
为了避免常见的内存问题, 应使用智能指针替代通常C风格的"裸"指针. 智能指针对象在超出作用域时, 例如在函数执行完毕后, 会自动释放内存. C++中有如下三种智能指针, 定义在头文件 <code>&lt;memory&gt;</code> 中.
</p>
<dl class="org-dl">
<dt><code>std::unique_ptr</code></dt><dd>通用的智能指针, 可以指向任意类型的内存, 是一个模板. 自从C++14以来, 可以使用 <code>std::make_unique&lt;&gt;()</code> 创建. 在尖括号中必须指定 <code>unique_ptr</code> 要指向的内存类型.</dd>
<dt><code>std::shared_ptr</code></dt><dd>可以使用 <code>std::make_shared&lt;&gt;()</code> 创建.</dd>
<dt><code>std::weak_ptr</code></dt><dd></dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgf35d62c" class="outline-2">
<h2 id="orgf35d62c">名称空间</h2>
<div class="outline-text-2" id="text-orgf35d62c">
<ul class="org-ul">
<li><code>::</code> 称为作用域解析运算符.</li>
<li><code>using</code> 指令可以用来引用名称空间的所有项或者特定项.</li>
<li>切勿在头文件中使用 <code>using</code> 指令或者 <code>using</code> 声明.</li>
</ul>
</div>
</div>
<div id="outline-container-org7e72fe1" class="outline-2">
<h2 id="org7e72fe1">数组</h2>
<div class="outline-text-2" id="text-org7e72fe1">
<ul class="org-ul">
<li>在C++中声明数组时, 必须声明数组的大小. 数组的大小不能用变量来表示&#x2013;必须用常量或常量表达式(constexpr)来表示数组大小.</li>
<li>数组也可以用初始化列表来初始化, 此时编译器可以自动推断出数组的大小.</li>
<li>C++有一种大小固定的特殊容器 <code>std::array</code>, 定义在 <code>&lt;array&gt;</code> 头文件中, 其具有迭代器, 可以方便地遍历元素. 必须在尖括号中指定两个参数, 第一个表示数组中元素的类型, 第二个参数表示数组的大小.</li>
</ul>
</div>
</div>
<div id="outline-container-org9606463" class="outline-2">
<h2 id="org9606463">字符串</h2>
<div class="outline-text-2" id="text-org9606463">
<ul class="org-ul">
<li>在C语言中, 字符串表示为字符的数组. 字符串中的最后一个字符是空字符(<code>\0</code>), 官方将这个空字符定义为 <code>NUL</code>. 这样, 操作字符串的代码就知道字符串在哪里结束.</li>
<li>与字面量(literal)关联的真正内存在内存的只读部分中.</li>
<li>原始字符串字面量(raw string literal)是可以跨越多行代码的字符串字面量, 形式为 <code>R"d(character sequence)d"</code>, 其中 <code>d</code> 表示分隔符序列, 无歧义(字符串字面量中无特殊符号, 如 <code>"</code>)时可以省略.</li>
<li>C++的 <code>string</code> 类定义在 <code>std</code> 名称空间的头文件 <code>&lt;string&gt;</code> 中. 此外, C++还包含了一些来自C语言的字符串操作函数, 定义在头文件 <code>&lt;cstring&gt;</code> 中.</li>
<li>为了兼容, 可以使用 <code>string</code> 的 <code>c_str()</code> 方法获得一个表示C风格字符串的 <code>const</code> 字符指针. 不过, 一旦 <code>string</code> 对象被销毁或执行了任何内存重分配, 这个返回的 <code>const</code> 字符指针就失效了.</li>
<li>数值转换</li>
</ul>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #b22222;">// </span><span style="color: #b22222;">Transformation to string</span>
<span style="color: #228b22;">string</span> <span style="color: #0000ff;">to_string</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">val</span>);
<span style="color: #228b22;">string</span> <span style="color: #0000ff;">to_string</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">val</span>);
<span style="color: #228b22;">string</span> <span style="color: #0000ff;">to_string</span>(<span style="color: #228b22;">long</span> <span style="color: #a0522d;">val</span>);
<span style="color: #228b22;">string</span> <span style="color: #0000ff;">to_string</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #a0522d;">val</span>);
<span style="color: #228b22;">string</span> <span style="color: #0000ff;">to_string</span>(<span style="color: #228b22;">long</span> <span style="color: #228b22;">long</span> <span style="color: #a0522d;">val</span>);
<span style="color: #228b22;">string</span> <span style="color: #0000ff;">to_string</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #228b22;">long</span> <span style="color: #a0522d;">val</span>);
<span style="color: #228b22;">string</span> <span style="color: #0000ff;">to_string</span>(<span style="color: #228b22;">float</span> <span style="color: #a0522d;">val</span>);
<span style="color: #228b22;">string</span> <span style="color: #0000ff;">to_string</span>(<span style="color: #228b22;">double</span> <span style="color: #a0522d;">val</span>);
<span style="color: #228b22;">string</span> <span style="color: #0000ff;">to_string</span>(<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">val</span>);

<span style="color: #b22222;">// </span><span style="color: #b22222;">Transformation from string</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">stoi</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">string</span> &amp;<span style="color: #a0522d;">str</span>, <span style="color: #228b22;">size_t</span> *<span style="color: #a0522d;">idx</span> = 0, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">base</span> = 10);
<span style="color: #228b22;">long</span> <span style="color: #0000ff;">stol</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">string</span> &amp;<span style="color: #a0522d;">str</span>, <span style="color: #228b22;">size_t</span> *<span style="color: #a0522d;">idx</span> = 0, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">base</span> = 10);
<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #0000ff;">stoul</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">string</span> &amp;<span style="color: #a0522d;">str</span>, <span style="color: #228b22;">size_t</span> *<span style="color: #a0522d;">idx</span> = 0, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">base</span> = 10);
<span style="color: #228b22;">long</span> <span style="color: #228b22;">long</span> <span style="color: #0000ff;">stoll</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">string</span> &amp;<span style="color: #a0522d;">str</span>, <span style="color: #228b22;">size_t</span> *<span style="color: #a0522d;">idx</span> = 0, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">base</span> = 10);
<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #228b22;">long</span> <span style="color: #0000ff;">stoll</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">string</span> &amp;<span style="color: #a0522d;">str</span>, <span style="color: #228b22;">size_t</span> *<span style="color: #a0522d;">idx</span> = 0, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">base</span> = 10);
<span style="color: #228b22;">float</span> <span style="color: #0000ff;">stof</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">string</span> &amp;<span style="color: #a0522d;">str</span>, <span style="color: #228b22;">size_t</span> *<span style="color: #a0522d;">idx</span> = 0, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">base</span> = 10);
<span style="color: #228b22;">double</span> <span style="color: #0000ff;">stof</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">string</span> &amp;<span style="color: #a0522d;">str</span>, <span style="color: #228b22;">size_t</span> *<span style="color: #a0522d;">idx</span> = 0, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">base</span> = 10);
<span style="color: #228b22;">long</span> <span style="color: #228b22;">double</span> <span style="color: #0000ff;">stof</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">string</span> &amp;<span style="color: #a0522d;">str</span>, <span style="color: #228b22;">size_t</span> *<span style="color: #a0522d;">idx</span> = 0, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">base</span> = 10);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9138e4" class="outline-2">
<h2 id="orgc9138e4"><code>switch</code></h2>
<div class="outline-text-2" id="text-orgc9138e4">
<p>
在 <code>switch</code> 语句中, 表达式必须是整型或能转换为整型的类型, 必须与一个常量进行比较.
</p>
</div>
</div>
<div id="outline-container-org4c085b0" class="outline-2">
<h2 id="org4c085b0">基于区间的 <code>for</code> 循环</h2>
<div class="outline-text-2" id="text-org4c085b0">
<p>
基于区间的 <code>for</code> 循环(range-based for loop)允许方便地迭代容器中的元素. 这种循环类型可以用于C风格的数组, 初始化列表, 也可以用于具有返回迭代器的 <code>begin()</code> 和 <code>end()</code> 函数的类型, 如 <code>std::array</code> 和其他所有STL容器.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #008b8b;">std</span>::<span style="color: #228b22;">array</span>&lt;<span style="color: #228b22;">int</span>, 3&gt; <span style="color: #a0522d;">arr</span> = {1, 2, 3};
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> : arr)
    <span style="color: #008b8b;">std</span>::cout &lt;&lt; i &lt;&lt; <span style="color: #008b8b;">std</span>::endl;
</pre>
</div>
</div>
</div>
<div id="outline-container-org41cea73" class="outline-2">
<h2 id="org41cea73">异常</h2>
<div class="outline-text-2" id="text-org41cea73">
<p>
当某段代码检测到异常时, 就会抛出一个异常. 另一段代码会捕获这个异常并执行相应的操作.
</p>
</div>
</div>
<div id="outline-container-orgebbf2d9" class="outline-2">
<h2 id="orgebbf2d9"><code>const</code></h2>
<div class="outline-text-2" id="text-orgebbf2d9">
<ol class="org-ol">
<li>取代 <code>#define</code> 定义常量.</li>
<li>保护参数(如引用参数).</li>
<li>在类的定义中, 最好将不改变对象的任何数据成员的成员函数声明为 <code>const</code>.</li>
</ol>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Marc Gregoire著, 张永强译. C++高级编程(第3版), 清华大学出版社, 2015.
</p></div></div>


</div>
</div></div>
</body>
</html>
